{
    "pipeline": "split",
    "args": {
        "input_video_path": "s3://lha-datasets/nuscenes/processed_data/v0",
        "output_clip_path": "s3://lha-datasets/nuscenes/processed_data/v1",
        "generate_embeddings": false,
        "generate_previews": false,
        "generate_captions": true,
        "splitting_algorithm": "fixed-stride",
        "fixed_stride_split_duration": 100000000,
        "captioning_algorithm": "qwen",
        "captioning_prompt_variant": "default",
        "captioning_prompt_text": "You are an expert at generating highly relevant and factual multiple-choice questions (MCQs) and corresponding answers directly from driving video content. Your goal is to create a comprehensive set of MCQs that capture critical details within the driving scene.\n\nFor each video, you will generate 10 distinct question-and-answer pairs. **Crucially, ensure that these questions are entirely original and do not replicate any of the example questions provided in this prompt.** Each question should be a clear, concise, factual inquiry about the visual information presented in the video. The answer must be a single word or short phrase, directly and accurately addressing the question. Prioritize questions that assess key elements of the driving environment, vehicle actions, and potential hazards or regulations.\n\nExamples of effective question types (for reference only – do NOT repeat these exact questions in your output):\n\n* Environmental Features: \"What type of road surface is the vehicle currently on?\" (Asphalt/Gravel/Dirt)\n* Lane Markings & Signals: \"Are there solid white lines marking the edge of the lane?\" (Yes/No)\n* Traffic Elements: \"How many active traffic lights are visible at the intersection ahead?\" (Zero/One/Two/Three)\n* Vehicle State & Action: \"Is the vehicle currently indicating a turn?\" (Yes/No)\n* Surrounding Context: \"Are there pedestrians visible on the sidewalk?\" (Yes/No)\n* Road Signs & Markings: \"Is a 'STOP' sign visible in the current frame?\" (Yes/No)\n* Time of Day/Weather: \"Does the scene appear to be taking place at night?\" (Yes/No)\n* Object Identification: \"What is the primary color of the car directly in front of the vehicle?\" (Red/Blue/White/Black)\n* Relative Position: \"Is there a vehicle directly to the right of the ego vehicle?\" (Yes/No)\n* Infrastructure Details: \"Are there overhead power lines visible?\" (Yes/No)\n\n---\n\n### Additional Guidelines for Question Generation\n\n* **Focus on Actionable Information:** Prioritize questions whose answers would be crucial for an autonomous driving system to understand or act upon (e.g., \"Is there an obstacle in the immediate path?\").\n* **Vary Question Complexity:** Include a mix of simple observation questions (e.g., \"Is it raining?\") and slightly more inferential questions based purely on visual cues (e.g., \"Does the vehicle appear to be in a residential area?\").\n* **Include Numerical Questions:** When appropriate, ask questions that require counting visible objects (e.g., \"How many cars are parked on the left side of the street?\").\n* **Consider Dynamic Elements:** Questions about moving objects are valuable (e.g., \"Is there an oncoming vehicle in the opposite lane?\").\n* **Avoid Ambiguity:** Ensure questions can be answered definitively based *only* on the visual content of the video. Do not ask questions that require external knowledge or speculation (e.g., \"Is the driver feeling stressed?\").\n* **Address Negative Cases:** Explicitly ask about the *absence* of certain features when relevant (e.g., \"Are there any traffic cones present? (Yes/No)\" rather than just assuming their presence).\n* **Prioritize Safety-Critical Scenarios:** Generate questions that help identify potential hazards or safety-related elements, even if subtle (e.g., \"Is there a brake light illuminated on the vehicle ahead?\").\n* **If a detail is not visible or not applicable, state \"N/A\" or \"Not Applicable\" clearly.** For example, if asked \"What is the speed limit sign visible?\" and no sign is present, the answer should be \"N/A\". This helps distinguish between a false answer and an unanswerable question.\n* **Ensure Diversity:** Strive for unique questions in each set of 10, avoiding highly similar inquiries about the same object or scene aspect. **Every generated question must be distinct from all other questions generated for the same video.**",
        "limit": 0,
        "limit_clips": 0,
        "perf_profile": true
   }
}
